{"text":["Home • Angular\nSkip to main content\nmenu\nclose\n v19 \nK\nDocs\nTutorials\nPlayground\nReference\nmore_horiz\nAngular v19 is here!\nRead about our newest release.\nWorks at any scale\n Angular lets you start small on a well-lit path and supports you as your team and apps grow. \nLoved by millions\n Join the millions of developers all over the world building with Angular in a thriving and friendly community. \n Build for everyone \nBuild for everyone\n Rely on Angular's built-in hydration, internationalization, security, and accessibility support to build for everyone around the world. \nBuild for everyone\n Rely on Angular's built-in hydration, internationalization, security, and accessibility support to build for everyone around the world. \n Learn Angular \nSocial Media\nBlog\nX (formerly Twitter)\nYouTube\n Discord \nGitHub\n Stack Overflow \nCommunity\n Contribute \n Code of Conduct \n Report Issues \n Google's DevLibrary \n Angular Google Developer Experts \nResources\nPress Kit\nRoadmap\nLanguages\n简体中文版\n正體中文版\n日本語版\n한국어\n Ελληνικά \n Super-powered by Google ©2010-2024. Code licensed under an \nMIT-style License\n . Documentation licensed under \nCC BY 4.0\n . "],"title":["Home • Angular"],"url":["https://angular.dev/"]}
{"text":["License • Angular\nSkip to main content\nmenu\nclose\n v19 \nK\nDocs\nTutorials\nPlayground\nReference\nmore_horiz\nThe MIT License\nCopyright (c) 2010-2024 Google LLC. \nhttps://angular.dev/license\nPermission is hereby granted, free of charge, to any person obtaining a copy of this software and associated documentation files (the \"Software\"), to deal in the Software without restriction, including without limitation the rights to use, copy, modify, merge, publish, distribute, sublicense, and/or sell copies of the Software, and to permit persons to whom the Software is furnished to do so, subject to the following conditions:\nThe above copyright notice and this permission notice shall be included in all copies or substantial portions of the Software.\nTHE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.\nSocial Media\nBlog\nX (formerly Twitter)\nYouTube\n Discord \nGitHub\n Stack Overflow \nCommunity\n Contribute \n Code of Conduct \n Report Issues \n Google's DevLibrary \n Angular Google Developer Experts \nResources\nPress Kit\nRoadmap\nLanguages\n简体中文版\n正體中文版\n日本語版\n한국어\n Ελληνικά \n Super-powered by Google ©2010-2024. Code licensed under an \nMIT-style License\n . Documentation licensed under \nCC BY 4.0\n . "],"title":["License • Angular"],"url":["https://angular.dev/license"]}
{"text":["Home • Angular\nSkip to main content\nmenu\nclose\n v19 \nK\nDocs\nTutorials\nPlayground\nReference\nmore_horiz\nAngular v19 is here!\nRead about our newest release.\nWorks at any scale\n Angular lets you start small on a well-lit path and supports you as your team and apps grow. \nLoved by millions\n Join the millions of developers all over the world building with Angular in a thriving and friendly community. \n Build for everyone \nBuild for everyone\n Rely on Angular's built-in hydration, internationalization, security, and accessibility support to build for everyone around the world. \nBuild for everyone\n Rely on Angular's built-in hydration, internationalization, security, and accessibility support to build for everyone around the world. \n Learn Angular \nSocial Media\nBlog\nX (formerly Twitter)\nYouTube\n Discord \nGitHub\n Stack Overflow \nCommunity\n Contribute \n Code of Conduct \n Report Issues \n Google's DevLibrary \n Angular Google Developer Experts \nResources\nPress Kit\nRoadmap\nLanguages\n简体中文版\n正體中文版\n日本語版\n한국어\n Ελληνικά \n Super-powered by Google ©2010-2024. Code licensed under an \nMIT-style License\n . Documentation licensed under \nCC BY 4.0\n . "],"title":["Home • Angular"],"url":["https://angular.dev/"]}
{"text":["Playground • Angular\nSkip to main content\nmenu\nclose\n v19 \nK\nDocs\nTutorials\nPlayground\nReference\nmore_horiz\nAngular Playground\nSelect a template\nHello world\nexpand_more"],"title":["Playground • Angular"],"url":["https://angular.dev/playground"]}
{"text":["Learn Angular • Angular\nSkip to main content\nmenu\nclose\n v19 \nK\nDocs\nTutorials\nPlayground\nReference\nmore_horiz\nunfold_more\nLearn Angular\nIntroduction\nchevron_left\nchevron_right\nunfold_more\nLearn Angular\nIntroduction\nchevron_left\nchevron_right\nWelcome to the Angular tutorial\nThis interactive tutorial will teach you the basic building blocks to start building great apps with Angular.\nHow to use this tutorial\nYou'll need to have basic familiarity with HTML, CSS and JavaScript to understand Angular.\nEach step represents a concept in Angular. You can do one, or all of them.\nIf you get stuck, click \"Reveal answer\" at the top.\nAlright, let's \nget started\n."],"title":["Learn Angular • Angular"],"url":["https://angular.dev/tutorials/learn-angular"]}
{"text":["Press Kit • Angular\nSkip to main content\nmenu\nclose\n v19 \nK\nDocs\nTutorials\nPlayground\nReference\nmore_horiz\nAngular Press Kit\nThe logo graphics available for download on this page are provided under \nCC BY 4.0\n.\nAngular logos\n    Black and white are the default color variations and should be used in most circumstances. A gradient version of the icon and lockup is available in both static and animated formats and can be used in cases where a color icon is required.\nDownload from Google Drive\nBrand guidelines\n    Our brand guidelines folders contain the design files, guidance and community examples for how the brand can be adapted.\n    Read more about adapting the logo in the section below.\nDownload from Google Drive\nOn this page\n Press and Media \n Adapting the logo \n Adapt the logo colors as your own \n Adapt the logo shape as your own \n Do’s and don’ts of using Angular's brand \n Deprecated logos \n 2016 Angular (v3-v16) \n AngularJS \nPress and Media\nFor inquiries regarding press and media please contact us at \npress@angular.io\n. For developer inquiries contact \ndevrel@angular.io\n.\nAdapting the logo\nAngular’s success is deeply connected to our community. We know many communities, meetups, conferences, blogs, websites, YouTube channels and developers have built their brand on top of ours. This logo is for us and our community, and it’s important that you can join us in updating your brand as well.\nAngular has long valued creative expression through customized shield icons. The new Angular icon allows customization in several ways. The icon shape can be used as a container for simple colors and patterns. Alternatively, a custom backplate can be used for more intricate designs. We recommend keeping your compositions simple and clear, since busy and complex patterns can be difficult to read. We appreciate your cooperation in keeping our community a safe and welcoming space. Please keep designs respectful and be mindful of our community guidelines when creating your icons.\nWe have provided a template to get you started.\nIf you have any questions on adapting the new logo, or updating your own, please email \ndevrel@angular.io\n for additional help – we can’t wait to see what you create!\nAdapt the logo colors as your own\nLean into the shape of Angular’s new logo by changing the logo colors to match your brand colors, flag, cause, etc.\nIn this example, we’ve adapted the colors to create an Angular Pride logo variation:\nAdapt the logo shape as your own\nLean into the shape of Angular’s new logo by adapting the shield to match your own brand.\nIn this example, we’ve adapted the shield to create an Angular Signals logo variation:\nDo’s and don’ts of using Angular's brand\nIf you are creating your own logo, we encourage differentiating your logo from ours to not cause confusion. When adapting the logo, you are free to change and adapt the colors and shape to make it your own.\nWhen representing Angular with the original logo, please follow these guidelines:\nDeprecated logos\n2016 Angular (v3-v16)\nIn 2023 , we announced a modernized logo with v17. We advise against using the former Angular logo to prevent confusion. You can view the old press kit on our \nold docs site\n.\nAngularJS\nAngularJS is the v1.x predecessor of modern Angular. We advise against using this logo to prevent confusion.\nRead more about the discontinued LTS (Long Term Support) for AngularJS on our \nblog\n.\nSocial Media\nBlog\nX (formerly Twitter)\nYouTube\n Discord \nGitHub\n Stack Overflow \nCommunity\n Contribute \n Code of Conduct \n Report Issues \n Google's DevLibrary \n Angular Google Developer Experts \nResources\nPress Kit\nRoadmap\nLanguages\n简体中文版\n正體中文版\n日本語版\n한국어\n Ελληνικά \n Super-powered by Google ©2010-2024. Code licensed under an \nMIT-style License\n . Documentation licensed under \nCC BY 4.0\n . "],"title":["Press Kit • Angular"],"url":["https://angular.dev/press-kit"]}
{"text":["Roadmap • Angular\nSkip to main content\nmenu\nclose\n v19 \nK\nDocs\nTutorials\nPlayground\nReference\nmore_horiz\nmenu\nAPI\nRoadmap\nGet involved\nAPI Reference\nCLI Reference\nError Encyclopedia\nExtended Diagnostics\nVersioning and releases\nVersion compatibility\nUpdate guide\nConfigurations\nMigrations\nAngular Roadmap\nLearn how the Angular team is building momentum on the web.\nAs an open source project, Angular’s daily commits, PRs and momentum is all trackable on GitHub. To increase transparency into how this daily work connects to the framework’s future, our roadmap brings together the team’s current and future planned vision.\nThe following projects are not associated with a particular Angular version. We will release them on completion, and they will be part of a specific version based on our release schedule, following semantic versioning. For example, we release features in the next minor after completion or the next major if they include breaking changes.\nCurrently, Angular has two goals for the framework:\nImprove the \nAngular developer experience\n and\nImprove the \nframework’s performance\n.\nContinue reading to learn how we plan to deliver these objectives with specific project work.\nOn this page\n Explore modern Angular \n Available to experiment with \n Production ready \n Improving the Angular developer experience \n Developer velocity \n Improve Angular Material and the CDK \n Improve tooling \n Fast by default \n Future work, explorations, and prototyping \n Completed projects \nExplore modern Angular\nStart developing with the latest Angular features from our roadmap. This list represents the current status of new features from our roadmap:\nAvailable to experiment with\nIncremental hydration\nZoneless change detection\nHydration support for i18n blocks\nResource API\nEffect API\nLinked Signal API\nRoute-level render mode\nProduction ready\nExplore Angular Signals\nEvent replay with SSR\nDeferrable views\nBuilt-in control flow\nLocal variable declaration\nSignal inputs\nModel inputs\nSignal queries\nFunction-based outputs\nImproving the Angular developer experience\nDeveloper velocity\nDeliver Angular Signals\nThis project rethinks the Angular reactivity model by introducing Signals as a reactivity primitive. The initial planning resulted in hundreds of discussions, conversations with developers, feedback sessions, user experience studies, and a series of RFCs, which received over 1,000 comments.\n  As part of the v17 release, we graduated the Angular Signals library from developer preview. In v19 we moved signal-based queries, inputs, and model inputs to stable. Next, we'll need to finalize effects before we complete this project.\nLearn more\nZoneless Angular\nIn v18 we shipped experimental zoneless support in Angular. It enables developers to use the framework without including zone.js in their bundle, which improves performance, debugging experience, and interoperability. As part of the initial release we also introduced zoneless support to the Angular CDK and Angular Material.\n  In v19 we introduced zoneless support in server-side rendering, addressed some edge cases, and created a schematic to scaffold zoneless projects. We transitioned \nGoogle Fonts\n to zoneless which improved performance, developer experience, and allowed us to identify gaps that we need to address before moving this feature to developer preview. Stay tuned for more updates in the next months.\nSignal integrations\nWe're working towards improving the integration of fundamental Angular packages, such as forms, HTTP, and router, with Signals. As part of this project, we'll seek opportunities to introduce convenient signal-based APIs or wrappers to improve the holistic developer experience.\nSignal debugging in Angular DevTools\nWith the evolution of Signals in Angular, we are working on a better tooling for debugging them. High on the priority list is a UI for inspecting and debugging signals.\nImprove HMR (Hot Module Reload)\nWe're working towards faster edit/refresh cycle by enabling hot module replacement.\n  In Angular v19 we shipped initial support for CSS and template HMR. We'll continue collecting feedback to make sure we're addressing developers' needs before we mark this project as complete.\nLearn more\nImprove Angular Material and the CDK\nNew CDK primitives\nWe are working on new CDK primitives to facilitate creating custom components based on the WAI-ARIA design patterns for \nCombobox\n. Angular v14 introduced stable \nmenu and dialog primitives\n as part of this project, and in v15 Listbox.\nAngular component accessibility\nWe are evaluating components in Angular Material against accessibility standards such as WCAG and working to fix any issues that arise from this process.\nImprove tooling\nModernize unit testing tooling with ng test\nIn v12, we revisited the Angular end-to-end testing experience by replacing Protractor with modern alternatives such as Cypress, Nightwatch, Puppeteer, Playwright, and Webdriver.io. Next, we'd like to tackle \nng test\n to modernize Angular's unit testing experience.\n  We're currently evaluating Web Test Runner, Vitest, and Jest as candidates for a new test runner for Angular projects while preserving Jasmine as assertion library to not break existing tests.\nEvaluating Nitro support in the Angular CLI\nWe're excited about the set of features that Nitro offers such as more deployment options, improved compatibility of server-side rendering with different runtimes and file-based routing. In 2025 we'll evaluate how it fits in the Angular server-side rendering model.\n  We'll share updates as we make progress in this investigation.\nLearn more\nFast by default\nEnable incremental hydration\nIn v17 we graduated hydration from developer preview and we've been consistently observing 40-50% improvements in LCP. Since then we started prototyping incremental hydration and shared a demo on stage at ng-conf.\n  In v19 we shipped the incremental hydration in developer preview mode, powered by \n@defer\n blocks. Give it a try and \nshare your feedback\n with us!\nServer route configuration\nWe're working towards enabling a more ergonomic route configuration on the server. We want to make it trivial to declare which routes should be server-side rendered, prerendered or client-side rendered.\n  In Angular v19 we shipped developer preview of route-level render mode which allows you to granularly configure which routes you want Angular to prerender, server-side render or client-side render.\nFuture work, explorations, and prototyping\nThis section represents explorations and prototyping of potential future projects. A reasonable outcome is to decide that our current solutions are the best options. Other projects may result in RFCs, graduating to in-progress projects, or being deprioritized as the web continues to innovate along with our framework.\nSignal Forms\nWe plan to analyze existing feedback about Angular forms and design a solution which addresses developers' requirements and uses Signals for management of reactive state.\nSelectorless\nTo reduce boilerplate and improve the ergonomics of standalone components we are now designing a solution that will make selectors optional. To use a component or directive you'll be able to import it and directly use it in a component's template.\n  We're still in early stages of planning selectorless. We'll share a request for comments when we have an early design and we're ready for next steps.\nExploration of streamed server-side rendering\nOver the past few releases we've been working on making Angular's server-side rendering story more robust. On our priority list is to explore streamed server-side rendering for zoneless application.\nInvestigation for authoring format improvements\nBased on our developer surveys' results we saw there are opportunities for improving the ergonomics of the component authoring format. The first step of the process will be to gather requirements and understand the problem space in advanced to an RFC. We'll share updates as we make progress. High priority in the future work will be backward compatibility and interoperability.\nImprove TestBed\nBased on feedback over the years and the recent updates in Angular's runtime, we'll evaluate TestBed to identify opportunities to improve developer experience and reduce boilerplate when developing unit tests.\nIncremental adoption\nAngular has been lacking the tools and the flexibility to add interactivity to a multi-page app or embed an Angular component inside of an existing app built with a different framework.\n  As part of this project, we'll explore the requirement space of cross framework interop and our build tooling offering to make this use case possible.\nCompleted projects\nSupport two-dimensional drag-and-drop\nAs part of this project, we implemented mixed orientation support for the Angular CDK drag and drop. This is one of the repository's most highly requested features.\nCompleted in Q2 2024\nEvent replay with SSR and prerendering\nIn v18 we introduced an event replay functionality when using server-side rendering or prerendering. For this feature we depend on the event dispatch primitive (previously known as jsaction) that is running on Google.com.\n  In Angular v19 we graduated event replay to stable and enabled it by default for all new projects.\nCompleted in Q4 2024\nIntegrate Angular Language Service with Schematics\nTo make it easier for developers to use modern Angular APIs, we enabled integration between the Angular language service and schematics which allows you to refactor your app with a single click.\nCompleted in Q4 2024\nStreamline standalone imports with Language Service\nAs part of this initiative, the language service automatically imports components and pipes in standalone and NgModule-based apps. Additionally, we've added a template diagnostic to highlight unused imports in standalone components, which should help make application bundles smaller.\nCompleted in Q4 2024\nLocal template variables\nWe've released the support for local template variables in Angular, see \n@let\n docs\n for additional information.\nCompleted in Q3 2024\nExpand the customizability of Angular Material\nTo provide better customization of our Angular Material components and enable Material 3 capabilities, we'll be collaborating with Google's Material Design team on defining token-based theming APIs.\n  In v17.2 we shared experimental support for Angular Material 3 and in v18 we graduated it to stable.\nCompleted in Q2 2024\nIntroduce deferred loading\nIn v17 we shipped deferrable views in developer preview, which provide an ergonomic API for deferred code loading. In v18 we enabled deferrable views for library developers and graduated the API to stable.\nCompleted in Q2 2024\niframe support in Angular DevTools\nWe enabled debugging and profiling of Angular apps embedded within an iframe on the page.\nCompleted in Q2 2024\nAutomation for transition of existing hybrid rendering projects to esbuild and vite\nIn v17 we shipped a vite and esbuild-based application builder and enabled it for new projects by default. It improves build time for projects using hybrid rendering with up to 87%. As part of v18 we shipped schematics and a guide that migrate existing projects using hybrid rendering to the new build pipeline.\nCompleted in Q2 2024\nMake Angular.dev the official home for Angular developers\nAngular.dev is the new site, domain and home for Angular development. The new site contains updated documentation, tutorials and guidance that will help developers build with Angular’s latest features.\nCompleted in Q2 2024\nIntroduce built-in control flow\nIn v17 we shipped a developer preview version of a new control flow. It brings significant performance improvements and better ergonomics for template authoring. We also provided a migration of existing \n*ngIf\n, \n*ngFor\n, and \n*ngSwitch\n which you can run to move your project to the new implementation. As of v18 the built-in control flow is now stable.\nCompleted in Q2 2024\nModernize getting started tutorial\nOver the past two quarters, we developed a new \nvideo\n and \ntextual\n tutorial based on standalone components.\nCompleted Q4 2023\nInvestigate modern bundlers\nIn Angular v16, we released a developer preview of an esbuild-based builder with support for \nng build\n and \nng serve\n. The \nng serve\n development server uses Vite and a multi-file compilation by esbuild and the Angular compiler. In v17 we graduated the build tooling from developer preview and enabled it by default for new projects.\nCompleted Q4 2023\nIntroduce dependency injection debugging APIs\nTo improve the debugging utilities of Angular and Angular DevTools, we'll work on APIs that provide access to the dependency injection runtime. As part of the project, we'll expose debugging methods that allow us to explore the injector hierarchy and the dependencies across their associated providers. As of v17, we shipped a feature that enables us to plug into the dependency injection life-cycle. We also launched a visualization of the injector tree and inspection of the providers declared inside each individual node,\nCompleted Q4 2023\nImprove documentation and schematics for standalone components\nWe released a developer preview of the \nng new --standalone\n schematics collection, allowing you to create apps free of NgModules. In v17 we switched the new application authoring format to standalone APIs and changed the documentation to reflect the recommendation. Additionally, we shipped schematics which support updating existing applications to standalone components, directives, and pipes. Even though NgModules will stick around for foreseeable future, we recommend you to explore the benefits of the new APIs to improve developer experience and benefit from the new features we build for them.\nCompleted Q4 2023\nExplore hydration and server-side rendering improvements\nIn v16, we released a developer preview of non-destructive full hydration, see the \nhydration guide\n and the \nblog post\n for additional information. We're already seeing significant improvements to Core Web Vitals, including \nLCP\n and \nCLS\n. In lab tests, we consistently observed 45% better LCP of a real-world app.\n  In v17 we launched hydration outside developer preview and did a series of improvements in the server-side rendering story, including: route discovery at runtime for SSG, up to 87% faster build times for hybrid rendered applications, prompt that enables hybrid rendering for new projects.\nCompleted Q4 2023\nNon-destructive full app hydration\nIn v16, we released a developer preview of non-destructive full hydration, which allows Angular to reuse existing DOM nodes on a server-side rendered page, instead of re-creating an app from scratch. See additional information in the hydration guide.\nCompleted Q1 2023\nImprovements in the image directive\nWe released the Angular image directive as stable in v15. We introduced a new fill mode feature that enables images to fit within their parent container rather than having explicit dimensions. Over the past two months, the Chrome Aurora team backported the directive to v12 and newer.\nCompleted Q1 2023\nDocumentation refactoring\nEnsure all existing documentation fits into a consistent set of content types. Update excessive use of tutorial-style documentation into independent topics. We want to ensure the content outside the main tutorials is self-sufficient without being tightly coupled to a series of guides. In Q2 2022, we refactored the template content and dependency injection. In Q1 2023, we improved the HTTP guides, and with this, we're putting the documentation refactoring project on hold.\nCompleted Q1 2023\nImprove image performance\nThe Aurora and the Angular teams are working on the implementation of an image directive that aims to improve Core Web Vitals. We shipped a stable version of the image directive in v15.\nCompleted Q4 2022\nModern CSS\nThe Web ecosystem evolves constantly and we want to reflect the latest modern standards in Angular. In this project we aim to provide guidelines on using modern CSS features in Angular to ensure developers follow best practices for layout, styling, etc. We shared official guidelines for layout and as part of the initiative stopped publishing flex layout.\nCompleted Q4 2022\nSupport adding directives to host elements\nA long-standing feature request is to add the ability to add directives to host elements. The feature lets developers augment their own components with additional behaviors without using inheritance. In v15 we shipped our directive composition API, which enables enhancing host elements with directives.\nCompleted Q4 2022\nBetter stack traces\nThe Angular and the Chrome DevTools are working together to enable more readable stack traces for error messages. In v15 we released improved relevant and linked stack traces. As a lower priority initiative, we'll be exploring how to make the stack traces friendlier by providing more accurate call frame names for templates.\nCompleted Q4 2022\nEnhanced Angular Material components by integrating MDC Web\nMDC Web is a library created by the Google Material Design team that provides reusable primitives for building Material Design components. The Angular team is incorporating these primitives into Angular Material. Using MDC Web aligns Angular Material more closely with the Material Design specification, expands accessibility, improves component quality, and improves the velocity of our team.\nCompleted Q4 2022\nImplement APIs for optional NgModules\nIn the process of making Angular simpler, we are working on introducing APIs that allow developers to initialize apps, instantiate components, and use the router without NgModules. Angular v14 introduces developer preview of the APIs for standalone components, directives, and pipes. In the next few quarters we'll collect feedback from developers and finalize the project making the APIs stable. As the next step we will work on improving use cases such as TestBed, Angular elements, etc.\nCompleted Q4 2022\nAllow binding to protected fields in templates\nTo improve the encapsulation of Angular components we enabled binding to protected members of the component instance. This way you'll no longer have to expose a field or a method as public to use it inside your templates.\nCompleted Q2 2022\nPublish guides on advanced concepts\nDevelop and publish an in-depth guide on change detection. Develop content for performance profiling of Angular apps. Cover how change detection interacts with Zone.js and explain when it gets triggered, how to profile its duration, as well as common practices for performance optimization.\nCompleted Q2 2022\nRollout strict typings for @angular/forms\nIn Q4 2021 we designed a solution for introducing strict typings for forms and in Q1 2022 we concluded the corresponding request for comments. Currently, we are implementing a rollout strategy with an automated migration step that will enable the improvements for existing projects. We are first testing the solution with more than 2,500 projects at Google to ensure a smooth migration path for the external community.\nCompleted Q2 2022\nRemove legacy View Engine\nAfter the transition of all our internal tooling to Ivy is completed, we will remove the legacy View Engine for reduced Angular conceptual overhead, smaller package size, lower maintenance cost, and lower codebase complexity.\nCompleted Q1 2022\nSimplified Angular mental model with optional NgModules\nTo simplify the Angular mental model and learning journey, we will be working on making NgModules optional. This work lets developers develop standalone components and implement an alternative API for declaring the compilation scope of the component. We kicked this project off with high-level design discussions that we captured in an RFC.\nCompleted Q1 2022\nDesign strict typing for @angular/forms\nWe will work on finding a way to implement stricter type checking for reactive forms with minimal backward incompatible implications. This way, we let developers catch more issues during development time, enable better text editor and IDE support, and improve the type checking for reactive forms.\nCompleted Q1 2022\nImprove integration of Angular DevTools with framework\nTo improve the integration of Angular DevTools with the framework, we are working on moving the codebase to the angular/angular monorepository. This includes transitioning Angular DevTools to Bazel and integrating it into the existing processes and CI pipeline.\nCompleted Q1 2022\nLaunch advanced compiler diagnostics\nExtend the diagnostics of the Angular compiler outside type checking. Introduce other correctness and conformance checks to further guarantee correctness and best practices.\nCompleted Q1 2022\nUpdate our e2e testing strategy\nTo ensure we provide a future-proof e2e testing strategy, we want to evaluate the state of Protractor, community innovations, e2e best practices, and explore novel opportunities. As first steps of the effort, we shared an RFC and worked with partners to ensure smooth integration between the Angular CLI and state-of-the-art tooling for e2e testing. As the next step, we need to finalize the recommendations and compile a list of resources for the transition.\nCompleted Q3 2021\nAngular libraries use Ivy\nEarlier in 2020, we shared an RFC for Ivy library distribution. After invaluable feedback from the community, we developed a design of the project. We are now investing in the development of Ivy library distribution, including an update of the library package format to use Ivy compilation, unblock the deprecation of the View Engine library format, and ngcc.\nCompleted Q3 2021\nImprove test times and debugging with automatic test environment tear down\nTo improve test time and create better isolation across tests, we want to change TestBed to automatically clean up and tear down the test environment after each test run.\nCompleted Q3 2021\nDeprecate and remove IE11 support\nInternet Explorer 11 (IE11) has been preventing Angular from taking advantage of some of the modern features of the Web platform. As part of this project we are going to deprecate and remove IE11 support to open the path for modern features that evergreen browsers provide. We ran an RFC to collect feedback from the community and decide on next steps to move forward.\nCompleted Q3 2021\nLeverage ES2017+ as the default output language\nSupporting modern browsers lets us take advantage of the more compact, expressive, and performant new syntax of JavaScript. As part of this project we will investigate what the blockers are to moving forward with this effort, and take the steps to enable it.\nCompleted Q3 2021\nAccelerated debugging and performance profiling with Angular DevTools\nWe are working on development tooling for Angular that provides utilities for debugging and performance profiling. This project aims to help developers understand the component structure and the change detection in an Angular app.\nCompleted Q2 2021\nStreamline releases with consolidated Angular versioning & branching\nWe want to consolidate release management tooling between the multiple GitHub repositories for Angular (angular/angular, angular/angular-cli, and angular/components). This effort lets us reuse infrastructure, unify and simplify processes, and improve the reliability of our release process.\nCompleted Q2 2021\nHigher developer consistency with commit message standardization\nWe want to unify commit message requirements and conformance across Angular repositories (angular/angular, angular/components, and angular/angular-cli) to bring consistency to our development process and reuse infrastructure tooling.\nCompleted Q2 2021\nTransition the Angular language service to Ivy\nThe goal of this project is to improve the experience and remove legacy dependency by transitioning the language service to Ivy. Today the language service still uses the View Engine compiler and type checking, even for Ivy apps. We want to use the Ivy template parser and improved type checking for the Angular Language service to match app behavior. This migration is also a step towards unblocking the removal of View Engine, which will simplify Angular, reduce the npm package size, and improve the maintainability of the framework.\nCompleted Q2 2021\nIncreased security with native Trusted Types in Angular\nIn collaboration with the Google security team, we are adding support for the new Trusted Types API. This web platform API helps developers build more secure web apps.\nCompleted Q2 2021\nOptimized build speed and bundle sizes with Angular CLI webpack 5\nAs part of the v11 release, we introduced an opt-in preview of webpack 5 in the Angular CLI. To ensure stability, we will continue iterating on the implementation to enable build speed and bundle size improvements.\nCompleted Q2 2021\nFaster apps by inlining critical styles in Universal apps\nLoading external stylesheets is a blocking operation, which means that the browser cannot start rendering your app until it loads all the referenced CSS. Having render-blocking resources in the header of a page can significantly impact its load performance, for example, its first contentful paint. To make apps faster, we have been collaborating with the Google Chrome team on inlining critical CSS and loading the rest of the styles asynchronously.\nCompleted Q1 2021\nImprove debugging with better Angular error messages\nError messages often bring limited actionable information to help developers resolve them. We have been working on making error messages more discoverable by adding associated codes, developing guides, and other materials to ensure a smoother debugging experience.\nCompleted Q1 2021\nImproved developer onboarding with refreshed introductory documentation\nWe will redefine the user learning journeys and refresh the introductory documentation. We will clearly state the benefits of Angular, how to explore its capabilities and provide guidance so developers can become proficient with the framework in as little time as possible.\nCompleted Q1 2021\nExpand component harnesses best practices\nAngular CDK introduced the concept of component test harnesses to Angular in version 9. Test harnesses let component authors create supported APIs for testing component interactions. We are continuing to improve this harness infrastructure and clarifying the best practices around using harnesses. We are also working to drive more harness adoption inside of Google.\nCompleted Q1 2021\nAuthor a guide for content projection\nContent projection is a core Angular concept that does not have the presence it deserves in the documentation. As part of this project we want to identify the core use cases and concepts for content projection and document them.\nCompleted Q2 2021\nMigrate to ESLint\nWith the deprecation of TSLint we will be moving to ESLint. As part of the process, we will work on ensuring backward compatibility with our current recommended TSLint configuration, implement a migration strategy for existing Angular apps and introduce new tooling to the Angular CLI toolchain.\nCompleted Q4 2020\nOperation Bye Bye Backlog (also known as Operation Byelog)\nWe are actively investing up to 50% of our engineering capacity on triaging issues and PRs until we have a clear understanding of broader community needs. After that, we will commit up to 20% of our engineering capacity to keep up with new submissions promptly.\nCompleted Q4 2020\nSocial Media\nBlog\nX (formerly Twitter)\nYouTube\n Discord \nGitHub\n Stack Overflow \nCommunity\n Contribute \n Code of Conduct \n Report Issues \n Google's DevLibrary \n Angular Google Developer Experts \nResources\nPress Kit\nRoadmap\nLanguages\n简体中文版\n正體中文版\n日本語版\n한국어\n Ελληνικά \n Super-powered by Google ©2010-2024. Code licensed under an \nMIT-style License\n . Documentation licensed under \nCC BY 4.0\n . "],"title":["Roadmap • Angular"],"url":["https://angular.dev/roadmap"]}
{"text":["Tutorials • Angular\nSkip to main content\nmenu\nclose\n v19 \nK\nDocs\nTutorials\nPlayground\nReference\nmore_horiz\nTutorials\nWelcome to the Angular tutorials! These tutorials will guide you through the core concepts of the framework, and get you started building performant, scalable apps.\nLearn Angular in your browser\nvia the Playground\nStart coding\nBuild your first Angular app locally\nvia npm\nStart coding\nDeferrable views\nvia the Playground\nStart coding"],"title":["Tutorials • Angular"],"url":["https://angular.dev/tutorials"]}
{"text":["What is Angular? • Angular\nSkip to main content\nmenu\nclose\n v19 \nK\nDocs\nTutorials\nPlayground\nReference\nmore_horiz\nmenu\nDocs\nIntroduction\nWhat is Angular?\nInstallation\nEssentials\nStart coding! 🚀\nIn-depth Guides\nSignals\nComponents\nTemplates\nDirectives\nDependency Injection\nRouting\nForms\nHTTP Client\nServer-side & hybrid-rendering\nTesting\nInternationalization\nExperimental features\nDeveloper Tools\nAngular CLI\nLibraries\nDevTools\nLanguage Service\nBest Practices\nStyle Guide\nSecurity\nAccessibility\nPerformance\nKeeping up-to-date\nExtended Ecosystem\nNgModules\nAnimations\nUsing RxJS with Angular\nService Workers & PWAs\nWeb workers\nAngular Fire\nGoogle Maps\nGoogle Pay\nYouTube player\nAngular CDK\nAngular Material\nIntroduction\nWhat is Angular?\nAngular is a web framework that empowers developers to build fast, reliable applications.\nMaintained by a dedicated team at Google, Angular provides a broad suite of tools, APIs, and\nlibraries to simplify and streamline your development workflow. Angular gives you\na solid platform on which to build fast, reliable applications that scale with both the size of\nyour team and the size of your codebase.\nWant to see some code?\n Jump over to our \nEssentials\n for a quick overview of\nwhat it's like to use Angular, or get started in the \nTutorial\n if you\nprefer following step-by-step instructions.\nOn this page\n Features that power your development \n Develop applications faster than ever \n Ship with confidence \n Works at any scale \n Open-source first \n A thriving community \nFeatures that power your development\nKeep your codebase organized with an opinionated component model and flexible dependency injection\nsystem\nAngular components make it easy to split your code into well-encapsulated parts.\n  The versatile dependency injection helps you keep your code modular, loosely-coupled, and\n  testable.\nGet started with Components\nGet fast state updates with fine-grained reactivity based on Signals\nOur fine-grained reactivity model, combined with compile-time optimizations, simplifies development and helps build faster apps by default.\n  Granularly track how and where state is used throughout an application, giving the framework the power to render fast updates via highly optimized instructions.\nExplore Angular Signals\nMeet your performance targets with SSR, SSG, hydration, and next-generation deferred loading\nAngular supports both server-side rendering (SSR) and static site generation (SSG) along\n    with full DOM hydration. \n@defer\n blocks in templates make it simple to declaratively divide\n    your templates into lazy-loadable parts.\nRead about SSR\nGuarantee everything works together with Angular's first-party modules for forms, routing, and\nmore\nAngular's router\n provides a feature-rich navigation toolkit, including support\n  for route guards, data resolution, lazy-loading, and much more.\nAngular's forms module\n provides a standardized system for form participation and validation.\nDevelop applications faster than ever\nEffortlessly build, serve, test, deploy with Angular CLI\nAngular CLI gets your project running in under a minute with the commands you need to\n  grow into a deployed production application.\nAngular CLI\nVisually debug, analyze, and optimize your code with the Angular DevTools browser extension\nAngular DevTools sits alongside your browser's developer tools. It helps debug and analyze your\n  app, including a component tree inspector, dependency injection tree view,\n  and custom performance profiling flame chart.\nAngular DevTools\nNever miss a version with ng update\nAngular CLI's \nng update\n runs automated code transformations that automatically handle routine\n  breaking changes, dramatically simplifying major version updates. Keeping up with the latest\n  version keeps your app as fast and secure as possible.\nng update\nStay productive with IDE integration in your favorite editor\nAngular's IDE language services powers code completion, navigation, refactoring, and real-time\n  diagnostics in your favorite editor.\nLanguage service\nShip with confidence\nVerified commit-by-commit against Google's colossal monorepo\nEvery Angular commit is checked against \nhundreds of thousands\n of tests in Google's internal code\n  repository, representing countless real-world scenarios.\n  Angular is committed to stability for some of Google’s largest products, including Google Cloud.\n  This commitment ensures changes are well-tested, backwards compatible, and include migration tools\n  whenever possible.\nLearn about Google's monorepo\nClear support policies and predictable release schedule\nAngular's predictable, time-based release schedule gives your organization confidence in the\n  stability and backwards compatibility of the framework. Long Term Support (LTS) windows make sure\n  you get critical security fixes when you need them. First-party update tools, guides and automated\n  migration schematics help keep your apps up-to-date with the latest advancements to the framework\n  and the web platform.\nVersioning & releasing\nWorks at any scale\nReach users everywhere with internationalization support\nAngular's internationalization features handle message translations and formatting, including\n  support for unicode standard ICU syntax.\nInternationalization\nProtect your users with security by default\nIn collaboration with Google's world-class security engineers, Angular aims to make development\n  safe by default. Built-in security features, including HTML sanitization and\n  trusted type support, help protect your users from common vulnerabilities like\n  cross-site scripting and cross-site request forgery.\nSecurity\nKeep large teams productive with Vite and esbuild\nAngular CLI includes a fast, modern build pipeline using Vite and ESBuild. Developers report\n  building projects with hundreds of thousands of lines of code in less than a minute.\nESBuild and Vite\nProven in some of Google's largest web apps\nLarge Google products build on top of Angular's architecture and help develop new features that\n  further improve Angular's scalability, from \nGoogle Fonts\n to \nGoogle Cloud\n.\nOpen-source first\nMade in the open on GitHub\nCurious what we’re working on? Every PR and commit is available on our GitHub. Run into an issue or bug? We triage GitHub issues regularly to ensure we’re responsive and engaged with our community, and solving the real world problems you’re facing.\nStar our GitHub\nBuilt with transparency\nOur team publishes a public roadmap of our current and future work and values your feedback. We publish Request for Comments (RFCs) to collect feedback on larger feature changes and ensure the community voice is heard while shaping the future direction of Angular.\nRead our public roadmap\nA thriving community\nCourses, blogs and resources\nOur community is composed of talented developers, writers, instructors, podcasters, and more. The Google for Developers library is just a sample of the high quality resources available for new and experienced developers to continue developing.\nCheck out DevLibrary\nOpen Source\nWe are thankful for the open source contributors who make Angular a better framework for everyone. From fixing a typo in the docs, to adding major features, we encourage anyone interested to get started on our GitHub.\nContribute to Angular\nCommunity partnerships\nOur team partners with individuals, educators, and enterprises to ensure we consistently are supporting developers. Angular Google Developer Experts (GDEs) represent community leaders around the world educating, organizing, and developing with Angular. Enterprise partnerships help ensure that Angular scales well for technology industry leaders.\nMeet the Angular GDEs\nPartnering with other Google technologies\nAngular partners closely with other Google technologies and teams to improve the web.\n  Our ongoing partnership with Chrome’s Aurora actively explores improvements to user experience across the web, developing built-in performance optimizations like NgOptimizedImage and improvements to Angular’s Core Web Vitals.\n  We are also working with \nFirebase\n, \nTensorflow\n, \nFlutter\n, \nMaterial Design\n, and \nGoogle Cloud\n to ensure we provide meaningful integrations across the developer workflow.\nJoin the momentum!\n      Read Angular's roadmap\n      Try out our playground\n      Learn with tutorials\n      Watch our YouTube course\n      Reference our APIs\nSocial Media\nBlog\nX (formerly Twitter)\nYouTube\n Discord \nGitHub\n Stack Overflow \nCommunity\n Contribute \n Code of Conduct \n Report Issues \n Google's DevLibrary \n Angular Google Developer Experts \nResources\nPress Kit\nRoadmap\nLanguages\n简体中文版\n正體中文版\n日本語版\n한국어\n Ελληνικά \n Super-powered by Google ©2010-2024. Code licensed under an \nMIT-style License\n . Documentation licensed under \nCC BY 4.0\n . "],"title":["What is Angular? • Angular"],"url":["https://angular.dev/overview"]}
{"text":["API Reference • Overview • Angular\nSkip to main content\nmenu\nclose\n v19 \nK\nDocs\nTutorials\nPlayground\nReference\nmore_horiz\nmenu\nAPI\nRoadmap\nGet involved\nAPI Reference\nCLI Reference\nError Encyclopedia\nExtended Diagnostics\nVersioning and releases\nVersion compatibility\nUpdate guide\nConfigurations\nMigrations\nAPI Reference\nsearch\nShow @deprecated\nFilter by Identifier type\nB\nBlock\nC\nClass\nK\nConst\n@\nDecorator\nD\nDirective\nEl\nElement\nE\nEnum\nF\nFunction\nI\nInterface\nP\nPipe\nM\nModule\nT\nType Alias\nIA\nInitializer API\n animations \nF\nanimate\nF\nanimateChild\nI\nAnimateChildOptions\nT\nAnimateTimings\nF\nanimation\nI\nAnimationAnimateChildMetadata\nI\nAnimationAnimateMetadata\nI\nAnimationAnimateRefMetadata\nC\nAnimationBuilder\nI\nAnimationEvent\nC\nAnimationFactory\nI\nAnimationGroupMetadata\nI\nAnimationKeyframesSequenceMetadata\nI\nAnimationMetadata\nE\nAnimationMetadataType\nI\nAnimationOptions\nI\nAnimationPlayer\nI\nAnimationQueryMetadata\nI\nAnimationQueryOptions\nI\nAnimationReferenceMetadata\nI\nAnimationSequenceMetadata\nI\nAnimationStaggerMetadata\nI\nAnimationStateMetadata\nI\nAnimationStyleMetadata\nI\nAnimationTransitionMetadata\nI\nAnimationTriggerMetadata\nK\nAUTO_STYLE\nF\ngroup\nF\nkeyframes\nC\nNoopAnimationPlayer\nF\nquery\nF\nsequence\nF\nstagger\nF\nstate\nF\nstyle\nF\ntransition\nF\ntrigger\nF\nuseAnimation\n animations/browser \nC\nAnimationDriver\nC\nNoopAnimationDriver\n animations/browser/testing \nC\nMockAnimationDriver\nC\nMockAnimationPlayer\n common \nK\nAPP_BASE_HREF\nP\nAsyncPipe\nC\nBrowserPlatformLocation\nM\nCommonModule\nP\nCurrencyPipe\nK\nDATE_PIPE_DEFAULT_OPTIONS\nP\nDatePipe\nI\nDatePipeConfig\nP\nDecimalPipe\nK\nDOCUMENT\nF\nformatCurrency\nF\nformatDate\nF\nformatNumber\nF\nformatPercent\nC\nHashLocationStrategy\nP\nI18nPluralPipe\nP\nI18nSelectPipe\nK\nIMAGE_CONFIG\nK\nIMAGE_LOADER\nT\nImageConfig\nT\nImageLoader\nI\nImageLoaderConfig\nI\nImagePlaceholderConfig\nF\nisPlatformBrowser\nF\nisPlatformServer\nP\nJsonPipe\nI\nKeyValue\nP\nKeyValuePipe\nC\nLocation\nK\nLOCATION_INITIALIZED\nI\nLocationChangeEvent\nI\nLocationChangeListener\nC\nLocationStrategy\nP\nLowerCasePipe\nD\nNgClass\nD\nNgComponentOutlet\nD\nNgFor\nD\nNgForOf\nC\nNgForOfContext\nD\nNgIf\nC\nNgIfContext\nC\nNgLocaleLocalization\nC\nNgLocalization\nD\nNgOptimizedImage\nD\nNgPlural\nD\nNgPluralCase\nD\nNgStyle\nD\nNgSwitch\nD\nNgSwitchCase\nD\nNgSwitchDefault\nD\nNgTemplateOutlet\nC\nPathLocationStrategy\nP\nPercentPipe\nC\nPlatformLocation\nI\nPopStateEvent\nK\nPRECONNECT_CHECK_BLOCKLIST\nK\nprovideCloudflareLoader\nK\nprovideCloudinaryLoader\nK\nprovideImageKitLoader\nK\nprovideImgixLoader\nF\nprovideNetlifyLoader\nF\nregisterLocaleData\nP\nSlicePipe\nP\nTitleCasePipe\nP\nUpperCasePipe\nK\nVERSION\nC\nViewportScroller\nC\nXhrFactory\n common/http \nC\nFetchBackend\nK\nHTTP_INTERCEPTORS\nK\nHTTP_TRANSFER_CACHE_ORIGIN_MAP\nC\nHttpBackend\nC\nHttpClient\nC\nHttpContext\nC\nHttpContextToken\nI\nHttpDownloadProgressEvent\nC\nHttpErrorResponse\nT\nHttpEvent\nE\nHttpEventType\nI\nHttpFeature\nE\nHttpFeatureKind\nC\nHttpHandler\nT\nHttpHandlerFn\nC\nHttpHeaderResponse\nC\nHttpHeaders\nI\nHttpInterceptor\nT\nHttpInterceptorFn\nI\nHttpParameterCodec\nC\nHttpParams\nI\nHttpParamsOptions\nI\nHttpProgressEvent\nC\nHttpRequest\nC\nHttpResponse\nC\nHttpResponseBase\nI\nHttpSentEvent\nE\nHttpStatusCode\nT\nHttpTransferCacheOptions\nI\nHttpUploadProgressEvent\nC\nHttpUrlEncodingCodec\nI\nHttpUserEvent\nC\nHttpXhrBackend\nC\nHttpXsrfTokenExtractor\nC\nJsonpClientBackend\nC\nJsonpInterceptor\nF\nprovideHttpClient\nF\nwithFetch\nF\nwithInterceptors\nF\nwithInterceptorsFromDi\nF\nwithJsonpSupport\nF\nwithNoXsrfProtection\nF\nwithRequestsMadeViaParent\nF\nwithXsrfConfiguration\n common/http/testing \nC\nHttpTestingController\nF\nprovideHttpClientTesting\nI\nRequestMatch\nC\nTestRequest\n common/testing \nK\nMOCK_PLATFORM_LOCATION_CONFIG\nC\nMockLocationStrategy\nC\nMockPlatformLocation\nI\nMockPlatformLocationConfig\nF\nprovideLocationMocks\nC\nSpyLocation\n common/upgrade \nC\n$locationShim\nC\n$locationShimProvider\nC\nAngularJSUrlCodec\nK\nLOCATION_UPGRADE_CONFIGURATION\nI\nLocationUpgradeConfig\nM\nLocationUpgradeModule\nC\nUrlCodec\n core \nB\n@defer\nB\n@for\nB\n@if\nB\n@let\nB\n@switch\nI\nAbstractType\nI\nAfterContentChecked\nI\nAfterContentInit\nF\nafterNextRender\nF\nafterRender\nF\nafterRenderEffect\nI\nAfterRenderOptions\nI\nAfterRenderRef\nI\nAfterViewChecked\nI\nAfterViewInit\nK\nANIMATION_MODULE_TYPE\nK\nAPP_BOOTSTRAP_LISTENER\nK\nAPP_ID\nI\nApplicationConfig\nC\nApplicationInitStatus\nM\nApplicationModule\nC\nApplicationRef\nF\nasNativeElements\nF\nassertInInjectionContext\nF\nassertNotInReactiveContext\nF\nassertPlatform\n@\nAttribute\nF\nbooleanAttribute\nI\nBootstrapOptions\nE\nChangeDetectionStrategy\nC\nChangeDetectorRef\nI\nClassProvider\nI\nClassSansProvider\nK\nCOMPILER_OPTIONS\nT\nCompilerOptions\n@\nComponent\nI\nComponentMirror\nC\nComponentRef\nF\ncomputed\nI\nConstructorProvider\nI\nConstructorSansProvider\nIA\ncontentChild\n@\nContentChild\nIA\ncontentChildren\n@\nContentChildren\nF\ncreateComponent\nI\nCreateComputedOptions\nI\nCreateEffectOptions\nF\ncreateEnvironmentInjector\nF\ncreateNgModule\nF\ncreatePlatform\nF\ncreatePlatformFactory\nI\nCreateSignalOptions\nK\nCSP_NONCE\nK\nCUSTOM_ELEMENTS_SCHEMA\nC\nDebugElement\nC\nDebugEventListener\nC\nDebugNode\nK\nDEFAULT_CURRENCY_CODE\nF\ndestroyPlatform\nC\nDestroyRef\n@\nDirective\nI\nDoBootstrap\nI\nDoCheck\nF\neffect\nT\nEffectCleanupFn\nT\nEffectCleanupRegisterFn\nI\nEffectRef\nC\nElementRef\nC\nEmbeddedViewRef\nF\nenableProdMode\nC\nEnvironmentInjector\nT\nEnvironmentProviders\nC\nErrorHandler\nK\nEventEmitter\nI\nExistingProvider\nI\nExistingSansProvider\nI\nFactoryProvider\nI\nFactorySansProvider\nF\nforwardRef\nI\nForwardRefFn\nF\ngetDebugNode\nF\ngetNgModuleById\nF\ngetPlatform\nI\nGetTestability\n@\nHost\nK\nHOST_TAG_NAME\nC\nHostAttributeToken\n@\nHostBinding\n@\nHostListener\nF\nimportProvidersFrom\nT\nImportProvidersSource\nF\ninject\n@\nInject\n@\nInjectable\nT\nInjectableProvider\nI\nInjectableType\nC\nInjectionToken\nI\nInjectOptions\nC\nInjector\nK\nINJECTOR\nI\nInjectorType\nIA\ninput\n@\nInput\nI\nInputOptions\nT\nInputOptionsWithoutTransform\nT\nInputOptionsWithTransform\nI\nInputSignal\nI\nInputSignalWithTransform\nF\nisDevMode\nF\nisSignal\nF\nisStandalone\nI\nIterableChangeRecord\nI\nIterableChanges\nI\nIterableDiffer\nI\nIterableDifferFactory\nC\nIterableDiffers\nI\nKeyValueChangeRecord\nI\nKeyValueChanges\nI\nKeyValueDiffer\nI\nKeyValueDifferFactory\nC\nKeyValueDiffers\nF\nlinkedSignal\nK\nLOCALE_ID\nF\nmakeEnvironmentProviders\nF\nmakeStateKey\nF\nmergeApplicationConfig\nE\nMissingTranslationStrategy\nIA\nmodel\nI\nModelOptions\nI\nModelSignal\nI\nModuleWithProviders\nEl\nng-container\nEl\nng-content\nEl\nng-template\nT\nNgIterable\n@\nNgModule\nC\nNgModuleRef\nC\nNgZone\nI\nNgZoneOptions\nK\nNO_ERRORS_SCHEMA\nF\nnumberAttribute\nI\nOnChanges\nI\nOnDestroy\nI\nOnInit\n@\nOptional\nIA\noutput\n@\nOutput\nC\nOutputEmitterRef\nI\nOutputOptions\nI\nOutputRef\nI\nOutputRefSubscription\nC\nPendingTasks\n@\nPipe\nI\nPipeTransform\nK\nPLATFORM_ID\nK\nplatformCore\nC\nPlatformRef\nT\nPredicate\nF\nprovideAppInitializer\nF\nprovideEnvironmentInitializer\nF\nprovideExperimentalCheckNoChangesForDebug\nF\nprovideExperimentalZonelessChangeDetection\nF\nprovidePlatformInitializer\nT\nProvider\nT\nProviderToken\nF\nprovideZoneChangeDetection\nC\nQuery\nC\nQueryList\nF\nreflectComponentType\nC\nRenderer2\nC\nRendererFactory2\nE\nRendererStyleFlags2\nI\nRendererType2\nK\nREQUEST\nK\nREQUEST_CONTEXT\nF\nresolveForwardRef\nF\nresource\nI\nResource\nT\nResourceLoader\nI\nResourceLoaderParams\nI\nResourceOptions\nI\nResourceRef\nE\nResourceStatus\nK\nRESPONSE_INIT\nF\nrunInInjectionContext\nC\nSanitizer\nI\nSchemaMetadata\nE\nSecurityContext\n@\nSelf\nF\nsetTestabilityGetter\nF\nsignal\nT\nSignal\nC\nSimpleChange\nI\nSimpleChanges\n@\nSkipSelf\nT\nStateKey\nI\nStaticClassProvider\nI\nStaticClassSansProvider\nT\nStaticProvider\nC\nTemplateRef\nC\nTestability\nC\nTestabilityRegistry\nI\nTrackByFunction\nC\nTransferState\nK\nTRANSLATIONS\nK\nTRANSLATIONS_FORMAT\nK\nType\nI\nTypeProvider\nF\nuntracked\nT\nValueEqualityFn\nI\nValueProvider\nI\nValueSansProvider\nC\nVersion\nK\nVERSION\nIA\nviewChild\n@\nViewChild\nIA\nviewChildren\n@\nViewChildren\nC\nViewContainerRef\nE\nViewEncapsulation\nC\nViewRef\nI\nWritableResource\nI\nWritableSignal\n core/rxjs-interop \nF\noutputFromObservable\nF\noutputToObservable\nF\npendingUntilEvent\nF\nrxResource\nI\nRxResourceOptions\nF\ntakeUntilDestroyed\nF\ntoObservable\nI\nToObservableOptions\nF\ntoSignal\nI\nToSignalOptions\n core/testing \nC\nComponentFixture\nK\nComponentFixtureAutoDetect\nK\nComponentFixtureNoNgZone\nE\nDeferBlockBehavior\nC\nDeferBlockFixture\nE\nDeferBlockState\nF\ndiscardPeriodicTasks\nF\nfakeAsync\nF\nflush\nF\nflushMicrotasks\nF\ngetTestBed\nF\ninject\nC\nInjectSetupWrapper\nT\nMetadataOverride\nI\nModuleTeardownOptions\nF\nresetFakeAsyncZone\nK\nTestBed\nI\nTestBedStatic\nC\nTestComponentRenderer\nI\nTestEnvironmentOptions\nI\nTestModuleMetadata\nF\ntick\nF\nwaitForAsync\nF\nwithModule\n elements \nF\ncreateCustomElement\nC\nNgElement\nI\nNgElementConfig\nI\nNgElementConstructor\nI\nNgElementStrategy\nI\nNgElementStrategyEvent\nI\nNgElementStrategyFactory\nK\nVERSION\nT\nWithProperties\n forms \nC\nAbstractControl\nC\nAbstractControlDirective\nI\nAbstractControlOptions\nD\nAbstractFormGroupDirective\nI\nAsyncValidator\nI\nAsyncValidatorFn\nD\nCheckboxControlValueAccessor\nD\nCheckboxRequiredValidator\nK\nCOMPOSITION_BUFFER_MODE\nT\nControlConfig\nC\nControlContainer\nC\nControlEvent\nI\nControlValueAccessor\nD\nDefaultValueAccessor\nD\nEmailValidator\nI\nForm\nC\nFormArray\nD\nFormArrayName\nC\nFormBuilder\nK\nFormControl\nD\nFormControlDirective\nD\nFormControlName\nI\nFormControlOptions\nI\nFormControlState\nT\nFormControlStatus\nC\nFormGroup\nD\nFormGroupDirective\nD\nFormGroupName\nC\nFormRecord\nC\nFormResetEvent\nM\nFormsModule\nC\nFormSubmittedEvent\nK\nisFormArray\nK\nisFormControl\nK\nisFormGroup\nK\nisFormRecord\nD\nMaxLengthValidator\nD\nMaxValidator\nD\nMinLengthValidator\nD\nMinValidator\nK\nNG_ASYNC_VALIDATORS\nK\nNG_VALIDATORS\nK\nNG_VALUE_ACCESSOR\nC\nNgControl\nD\nNgControlStatus\nD\nNgControlStatusGroup\nD\nNgForm\nD\nNgModel\nD\nNgModelGroup\nD\nNgSelectOption\nC\nNonNullableFormBuilder\nD\nNumberValueAccessor\nD\nPatternValidator\nC\nPristineChangeEvent\nD\nRadioControlValueAccessor\nD\nRangeValueAccessor\nM\nReactiveFormsModule\nD\nRequiredValidator\nD\nSelectControlValueAccessor\nD\nSelectMultipleControlValueAccessor\nT\nSetDisabledStateOption\nC\nStatusChangeEvent\nC\nTouchedChangeEvent\nK\nUntypedFormArray\nC\nUntypedFormBuilder\nK\nUntypedFormControl\nK\nUntypedFormGroup\nT\nValidationErrors\nI\nValidator\nI\nValidatorFn\nC\nValidators\nC\nValueChangeEvent\nK\nVERSION\n localize \nF\nclearTranslations\nF\nloadTranslations\nT\nMessageId\nT\nTargetMessage\n localize/init \nK\n$localize\n platform-browser \nF\nbootstrapApplication\nM\nBrowserModule\nC\nBy\nF\ncreateApplication\nF\ndisableDebugTools\nC\nDomSanitizer\nF\nenableDebugTools\nK\nEVENT_MANAGER_PLUGINS\nC\nEventManager\nC\nEventManagerPlugin\nK\nHAMMER_GESTURE_CONFIG\nK\nHAMMER_LOADER\nC\nHammerGestureConfig\nT\nHammerLoader\nM\nHammerModule\nI\nHydrationFeature\nE\nHydrationFeatureKind\nC\nMeta\nT\nMetaDefinition\nK\nplatformBrowser\nF\nprovideClientHydration\nF\nprovideProtractorTestingSupport\nK\nREMOVE_STYLES_ON_COMPONENT_DESTROY\nI\nSafeHtml\nI\nSafeResourceUrl\nI\nSafeScript\nI\nSafeStyle\nI\nSafeUrl\nI\nSafeValue\nC\nTitle\nK\nVERSION\nF\nwithEventReplay\nF\nwithHttpTransferCacheOptions\nF\nwithI18nSupport\nF\nwithIncrementalHydration\nF\nwithNoHttpTransferCache\n platform-browser-dynamic \nK\nplatformBrowserDynamic\nK\nVERSION\n platform-browser-dynamic/testing \nC\nBrowserDynamicTestingModule\nK\nplatformBrowserDynamicTesting\n platform-browser/animations \nK\nANIMATION_MODULE_TYPE\nM\nBrowserAnimationsModule\nI\nBrowserAnimationsModuleConfig\nM\nNoopAnimationsModule\nF\nprovideAnimations\nF\nprovideNoopAnimations\n platform-browser/animations/async \nF\nprovideAnimationsAsync\n platform-browser/testing \nM\nBrowserTestingModule\nK\nplatformBrowserTesting\n platform-server \nK\nBEFORE_APP_SERIALIZED\nK\nINITIAL_CONFIG\nI\nPlatformConfig\nF\nplatformServer\nC\nPlatformState\nF\nprovideServerRendering\nF\nrenderApplication\nF\nrenderModule\nC\nServerModule\nK\nVERSION\n platform-server/testing \nK\nplatformServerTesting\nC\nServerTestingModule\n router \nC\nActivatedRoute\nC\nActivatedRouteSnapshot\nC\nActivationEnd\nC\nActivationStart\nC\nBaseRouteReuseStrategy\nI\nCanActivate\nI\nCanActivateChild\nT\nCanActivateChildFn\nT\nCanActivateFn\nI\nCanDeactivate\nT\nCanDeactivateFn\nI\nCanMatch\nT\nCanMatchFn\nC\nChildActivationEnd\nC\nChildActivationStart\nC\nChildrenOutletContexts\nT\nComponentInputBindingFeature\nF\nconvertToParamMap\nF\ncreateUrlTreeFromSnapshot\nT\nData\nT\nDebugTracingFeature\nI\nDefaultExport\nC\nDefaultTitleStrategy\nF\ndefaultUrlMatcher\nC\nDefaultUrlSerializer\nT\nDetachedRouteHandle\nT\nDisabledInitialNavigationFeature\nT\nEnabledBlockingInitialNavigationFeature\nT\nEvent\nE\nEventType\nI\nExtraOptions\nT\nGuardResult\nC\nGuardsCheckEnd\nC\nGuardsCheckStart\nT\nInitialNavigation\nT\nInitialNavigationFeature\nT\nInMemoryScrollingFeature\nI\nInMemoryScrollingOptions\nI\nIsActiveMatchOptions\nT\nLoadChildren\nT\nLoadChildrenCallback\nF\nmapToCanActivate\nF\nmapToCanActivateChild\nF\nmapToCanDeactivate\nF\nmapToCanMatch\nF\nmapToResolve\nT\nMaybeAsync\nI\nNavigation\nI\nNavigationBehaviorOptions\nC\nNavigationCancel\nE\nNavigationCancellationCode\nC\nNavigationEnd\nC\nNavigationError\nT\nNavigationErrorHandlerFeature\nI\nNavigationExtras\nC\nNavigationSkipped\nE\nNavigationSkippedCode\nC\nNavigationStart\nC\nNoPreloading\nT\nOnSameUrlNavigation\nC\nOutletContext\nI\nParamMap\nT\nParams\nC\nPreloadAllModules\nT\nPreloadingFeature\nC\nPreloadingStrategy\nK\nPRIMARY_OUTLET\nF\nprovideRouter\nT\nQueryParamsHandling\nC\nRedirectCommand\nT\nRedirectFunction\nI\nResolve\nT\nResolveData\nC\nResolveEnd\nT\nResolveFn\nC\nResolveStart\nI\nRoute\nC\nRouteConfigLoadEnd\nC\nRouteConfigLoadStart\nC\nRouter\nK\nROUTER_CONFIGURATION\nK\nROUTER_INITIALIZER\nK\nROUTER_OUTLET_DATA\nI\nRouterConfigOptions\nT\nRouterConfigurationFeature\nC\nRouteReuseStrategy\nC\nRouterEvent\nI\nRouterFeature\nT\nRouterFeatures\nT\nRouterHashLocationFeature\nD\nRouterLink\nD\nRouterLinkActive\nD\nRouterLinkWithHref\nM\nRouterModule\nD\nRouterOutlet\nI\nRouterOutletContract\nC\nRouterPreloader\nC\nRouterState\nC\nRouterStateSnapshot\nT\nRoutes\nK\nROUTES\nC\nRoutesRecognized\nT\nRunGuardsAndResolvers\nC\nScroll\nC\nTitleStrategy\nI\nUrlCreationOptions\nC\nUrlHandlingStrategy\nT\nUrlMatcher\nT\nUrlMatchResult\nC\nUrlSegment\nC\nUrlSegmentGroup\nC\nUrlSerializer\nC\nUrlTree\nK\nVERSION\nI\nViewTransitionInfo\nT\nViewTransitionsFeature\nI\nViewTransitionsFeatureOptions\nF\nwithComponentInputBinding\nF\nwithDebugTracing\nF\nwithDisabledInitialNavigation\nF\nwithEnabledBlockingInitialNavigation\nF\nwithHashLocation\nF\nwithInMemoryScrolling\nF\nwithNavigationErrorHandler\nF\nwithPreloading\nF\nwithRouterConfig\nF\nwithViewTransitions\n router/testing \nC\nRouterTestingHarness\n router/upgrade \nF\nlocationSyncBootstrapListener\nK\nRouterUpgradeInitializer\nF\nsetUpLocationSync\n service-worker \nI\nNoNewVersionDetectedEvent\nF\nprovideServiceWorker\nM\nServiceWorkerModule\nC\nSwPush\nC\nSwRegistrationOptions\nC\nSwUpdate\nI\nUnrecoverableStateEvent\nI\nVersionDetectedEvent\nT\nVersionEvent\nI\nVersionInstallationFailedEvent\nI\nVersionReadyEvent\n ssr \nC\nAngularAppEngine\nF\ncreateRequestHandler\nE\nPrerenderFallback\nF\nprovideServerRoutesConfig\nE\nRenderMode\nT\nRequestHandlerFunction\nT\nServerRoute\nI\nServerRouteClient\nI\nServerRouteCommon\nI\nServerRoutePrerender\nI\nServerRoutePrerenderWithParams\nI\nServerRoutesConfigOptions\nI\nServerRouteServer\n ssr/node \nC\nAngularNodeAppEngine\nC\nCommonEngine\nI\nCommonEngineOptions\nI\nCommonEngineRenderOptions\nF\ncreateNodeRequestHandler\nF\ncreateWebRequestFromNodeRequest\nF\nisMainModule\nT\nNodeRequestHandlerFunction\nF\nwriteResponseToNodeResponse\n upgrade/static \nF\ndowngradeComponent\nF\ndowngradeInjectable\nF\ndowngradeModule\nF\ngetAngularJSGlobal\nF\nsetAngularJSGlobal\nD\nUpgradeComponent\nM\nUpgradeModule\nK\nVERSION\n upgrade/static/testing \nF\ncreateAngularJSTestingModule\nF\ncreateAngularTestingModule\n window.ng globals \nF\napplyChanges\nI\nComponentDebugMetadata\nI\nDirectiveDebugMetadata\nF\ngetComponent\nF\ngetContext\nF\ngetDirectiveMetadata\nF\ngetDirectives\nF\ngetHostElement\nF\ngetInjector\nF\ngetListeners\nF\ngetOwningComponent\nF\ngetRootComponents\nI\nListener\nSocial Media\nBlog\nX (formerly Twitter)\nYouTube\n Discord \nGitHub\n Stack Overflow \nCommunity\n Contribute \n Code of Conduct \n Report Issues \n Google's DevLibrary \n Angular Google Developer Experts \nResources\nPress Kit\nRoadmap\nLanguages\n简体中文版\n正體中文版\n日本語版\n한국어\n Ελληνικά \n Super-powered by Google ©2010-2024. Code licensed under an \nMIT-style License\n . Documentation licensed under \nCC BY 4.0\n . "],"title":["API Reference • Overview • Angular"],"url":["https://angular.dev/api"]}
